app/views/ads/show.html.erb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."ad_id" = ? ORDER BY "pictures"."id" ASC LIMIT ?  [["ad_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "pictures" WHERE "pictures"."ad_id" = ? LIMIT ?  [["ad_id", 1], ["LIMIT", 1]]
---
<p id="notice"><%= notice %></p>
<%unless @ad.pictures.empty? %>