app/views/home/index.html.erb

  <% @ads.each do |ad| %>
    <%unless ad.pictures.empty? %>
      <%= image_tag ad.pictures.first.image.url(:thumb) %><br/>
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."ad_id" = ? ORDER BY "pictures"."id" ASC LIMIT ?  [["ad_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "pictures" WHERE "pictures"."ad_id" = ? LIMIT ?  [["ad_id", 1], ["LIMIT", 1]]
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."ad_id" = ? ORDER BY "pictures"."id" ASC LIMIT ?  [["ad_id", 2], ["LIMIT", 1]]