app/controllers/ads_controller.rb

INSERT INTO "pictures" ("created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "ad_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ad = Ad.new(ad_params.except(:image))
    @ad.user = current_user
    picture = Picture.new
    picture.ad = @ad
    picture.image = params[:ad][:image]
    picture.save