app/controllers/profiles_controller.rb

  def update
    puts profile_params.inspect
    puts "sss\n\n\n" + params.inspect
    @profile.avatar = params[:user][:avatar]
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "users" SET "avatar_file_name" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar_file_name", "default_.png"], ["avatar_updated_at", "2018-12-20 22:03:55.622201"], ["updated_at", "2018-12-20 22:03:55.640515"], ["id", 3]]

    def set_profile
      @profile = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]